# GetExportFontInfo Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportFontTable..::..GetExportFontInfo Method
ExportFontTable Class See Also
---
Gets a copy of the font info associated to the input font key.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ExportFontInfo GetExportFontInfo(
	ExportFontKey exportFontKey
)
```

Visual Basic
---
```text
Public Function GetExportFontInfo ( _
	exportFontKey As ExportFontKey _
) As ExportFontInfo
```

Visual C++
---
```text
public:
ExportFontInfo^ GetExportFontInfo(
	ExportFontKey^ exportFontKey
)
```

# ### Parameters
exportFontKey
    Type: Autodesk.Revit.DB..::..ExportFontKey The export font Key.
# ### Return Value
Returns the fontInfo for this key.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | An entry with the given key is not present in the table. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportFontTable Class
Autodesk.Revit.DB Namespace